000100210616             PGM
000101210616             CALL       STRJOB
000102210616             ADDLIBLE   BCI433LIB
000104210616             MONMSG     CPF2103 /*MONMSG MUST BE PLACED IMMEDIATELY AFTER ADDLIBLE*/
000105210628             addlible   senecapay
000106210616             DSPSYSLVL  *DISPLAY
000107210616
000129210616             ENDPGM
000130210617
000131210617/*MONGMSG must be placed following the command to be monitored */
