000100210810          Dcl-Pr DayNumName Char(9);   //Dcl-Pr declare prototype
000200200402           DayIn Packed(1);
000300181112          End-Pr;
000400181112
