000001210605     A          R RISKFACTOR
000002210605     A                                  1 72DATE
000003210605     A                                      EDTCDE(Y)
000004210605     A                                  1  2USER
000005210605     A                                  2  2'JEFFREY''S PROGRAM'
000006210605     A                                  4  4'Birth Date:'
000007210605     A                                  4 35'Gender:'
000008210605     A                                  7  4'Cardiovascular Disease:'
000009210605     A                                  7 46'Diabetes:'
000010210605     A                                  9  4'Respiratory Disease:'
000011210605     A                                  9 36'High Blood Pressure:'
000012210605     A                                  1 21'C O V I D 1 9   R I S K   F A C T -
000013210605     A                                      O R S '
000014210605     A                                  6  4'Answer the Following with Y or N:'
000015210606     A            BIRTHDATE       L  B  4 17
000016210606     A  60                                  DSPATR(PR)
000017210605     A            GENDER         1   B  4 45
000018210605     A                                      VALUES('M' 'F')
000019210606     A  95                                  DSPATR(RI PC)
000020210606     A  60                                  DSPATR(PR)
000021210605     A  95                              4 54'Gender Must Not Be Blank'
000022210605     A                                  4 48'M/F'
000023210605     A            CVDISEASE      1   B  7 28
000024210605     A                                      VALUES('Y' 'N')
000025210606     A  96                                  DSPATR(RI PC)
000026210606     A  60                                  DSPATR(PR)
000027210605     A  96                              8  4'Cardiovascular Must Not Be Blank'
000028210605     A            DIABETES       1   B  7 58
000029210605     A                                      VALUES('Y' 'N')
000030210606     A  97                                  DSPATR(RI PC)
000031210606     A  60                                  DSPATR(PR)
000032210605     A  97                              8 46'Diabetes Must Not Be Blank'
000033210605     A            RSPDISEASE     1   B  9 27
000034210605     A                                      VALUES('Y' 'N')
000035210606     A  98                                  DSPATR(RI PC)
000036210606     A  60                                  DSPATR(PR)
000037210605     A  98                             10  4'Respiratory Must Not Be Blank'
000038210605     A            HBPRESSURE     1   B  9 58
000040210605     A                                      VALUES('Y' 'N')
000041210606     A  99                                  DSPATR(RI PC)
000042210606     A  60                                  DSPATR(PR)
000043210605     A  99                             10 36'High Blood Pressure Must Not Be Bl-
000044210605     A                                      ank'
000045210605     A          R RISKASSMNT                CF03(03 'Exit Program')
000046210605     A                                      OVERLAY
000047210606     A                                 13 26'R I S K   A S S E S S M E N T'
000048210606     A                                 15  4'Age'
000049210606     A            AGE            3Y 0O 17  4EDTCDE(1)
000050210606     A                                 15 12'Fatality Rate'
000051210606     A            FRATE          5  3O 17 16EDTCDE(1)
000052210606     A                                 17 24'%'
000053210606     A                                 15 33'Vaccination Recommendation'
000054210606     A                                 17 35'Cohort:'
000055210606     A            COHORT         9   O 17 43
000056210606     A                                 15 64'Total Queries:'
000057210606     A            TOTALQ         3Y 0O 17 69EDTCDE(1)
000058210606     A                                 19  6'F1 - Cohort Information'
000059210606     A                                 19 36'F3 - Exit'
000100      
000101210606     A*%%RS+<record-sequences>
000102210606     A*%%RS+ <sequence name="Untitled">
000103210606     A*%%RS+  <device type="display" width="80" height="24" />
000104210606     A*%%RS+  <record-write record-format="RISKFACTOR" />
000105210606     A*%%RS+  <record-write record-format="RISKASSMNT" />
000106210606     A*%%RS+ </sequence>
000107210606     A*%%RS </record-sequences>
