000010210617     A*%%TS  SD  20210201  151602  PANGBORN    REL-V7R4M0  5770-WDS
000020210201     A*%%EC
000030210201     A                                      DSPSIZ(24 80 *DS3)
000040210201     A          R RECORD1
000050210201     A*%%TS  SD  20210201  151602  PANGBORN    REL-V7R4M0  5770-WDS
000052210617     A                                      CF21(21 'Command Line')
000053210617     A                                      CA03(03 'Exit')
000054210617     A                                  1  3'Jeffrey Li'
000060210201     A                                  1 38'Lab 4'
000061210617     A                                  1 71DATE
000062210617     A                                      EDTCDE(Y)
000063210617     A                                  2  3'Your Full Name Above'
000064210617     A                                  2 71TIME
000070210201     A                                  5  3'Please select one of the following-
000080210201     A                                       options:'
000081210617     A                                  7 14'1.  Signed on User''s Message Queu-
000082210617     A                                      e'
000083210617     A                                  8 14'2.  Run Covid Information Applicat-
000084210617     A                                      ion'
000090210201     A                                  9 14'3.  Maximum Invalid Signon Attempt-
000100210201     A                                      s allowed'
000101210617     A                                 10 14'4.  Previous sign on by signed on -
000102210617     A                                      user'
000110210201     A                                 11 14'5.  Operating system level'
000140210201     A                                 15 17'Option:'
000141210617     A            OPTION         2   B 15 27
000142210617     A  30                                  DSPATR(RI PC)
000144210617     A  30                             15 34' Valid option must be entered '
000145210617     A            MSGTXT1       70     17  6
000146210617     A            MSGTXT2       70   O 18  6
000150210201     A                                 23  4'F3=Exit'
000160210201     A                                 23 17'F21=Comand Line '
