000100210623     A                                  DSPSIZ(24 80 *DS3)
000105210623
000106210623     A          R GETDATA
000107210623
000108210623     A                                  1  3'YOUR NAME'
000109210623
000110210623     A                                      DSPATR(RI)
000111210623                            A                                      DSPSIZ(24 80 *DS3)
000112210623
000113210623     A          R GETDATA
000114210623
000115210623     A                                  1  3'YOUR NAME'
000116210623
000117210623     A                                      DSPATR(RI)
000118210623
000119210623     A                                  1 23'S E N E C A   C O R P.'
000120210623
000121210623     A                                  1 68DATE
000122210623
000123210623     A                                      EDTCDE(Y)
000124210623
000125210623     A                                  2 21'MORTGAGE RATES CALCULATOR'
000126210623
000127210623     A                                  4 10'Applicant credit score'
000128210623
000129210623     A            CREDSCORE      3  0B  4 39EDTCDE(2)
000130210623
000131210623     A  77                                  DSPATR(RI PC)
000132210623
000133210623     A  99                                  DSPATR(PR)
000134210623
000135210623     A  77                              4 44'NOT ELIGIBLE FOR MORTGAGE'
000136210623
000137210623     A                                  5 10'Required mortgage amount'
000138210623
000139210623     A            MAMOUNT        9  0B  5 39EDTCDE(2 $)
000140210623
000141210623     A  99                                  DSPATR(PR)
000142210623
000143210623     A  78                                  DSPATR(RI PC)
000144210623
000145210623     A  78                              5 52'MUST NOT BE 0'
000146210623
000147210623     A                                  6 10'Mortage amortization period'
000148210623
000149210623     A            PERIOD         2  0B  6 39EDTCDE(2)
000150210623
000151210623     A  99                                  DSPATR(PR)
000152210623
000153210623     A  79                                  DSPATR(RI PC)
000154210623
000155210623     A                                  6 43'(In Years)'
000156210623
000157210623     A  79                              6 54'MUST NOT BE 0'
000158210623
000159210623     A                                  7 10'Rate type (Fixed/Variable)'
000160210623
000161210623     A            RATETYPE       1   B  7 39VALUES('F' 'V')
000162210623
000163210623     A  99                                  DSPATR(PR)
000164210623
000165210623     A  80                                  DSPATR(RI PC)
000166210623
000167210623     A                                  7 43'(F/V)'
000168210623
000169210623     A  80                              7 49'MUST NOT BE BLANK'
000170210623
000171210623     A          R SHOWRESULT                CF03(03)
000172210623
000173210623     A                                      OVERLAY
000174210623
000175210623     A                                 10 10'Rate available:'
000176210623
000177210623     A            RATE           3  2O 10 39EDTCDE(2)
000178210623
000179210623     A                                 11 10'Maturity date:'
000180210623
000181210623     A            MDATE           L    11 39
000182210623
000183210623     A                                 13 10'Total inquiries:'
000184210623
000185210623     A            COUNTER        2Y 0  13 38EDTCDE(1)
000186210623
000187210623     A                                 16  9'F3 - Exit'
000188210623
000189210623     A            SCOREDSC      10   O  9 39DSPATR(RI)
000190210623
000191210623     A                                  9 10'Score rating description:'
000192210623     A                                  1 23'S E N E C A   C O R P.'
000193210623
000194210623     A                                  1 68DATE
000195210623
000196210623     A                                      EDTCDE(Y)
000197210623                                                                           A
000198210623
000199210623     A          R GETDATA
000200210623
000201210623     A                                  1  3'YOUR NAME'
000202210623
000203210623     A                                      DSPATR(RI)
000204210623
000205210623     A                                  1 23'S E N E C A   C O R P.'
000206210623
000207210623     A                                  1 68DATE
000208210623
000209210623     A                                      EDTCDE(Y)
000210210623
000211210623     A                                  2 21'MORTGAGE RATES CALCULATOR'
000212210623
000213210623     A                                  4 10'Applicant credit score'
000214210623
000215210623     A            CREDSCORE      3  0B  4 39EDTCDE(2)
000216210623
000217210623     A  77                                  DSPATR(RI PC)
000218210623
000219210623     A  99                                  DSPATR(PR)
000220210623
000221210623     A  77                              4 44'NOT ELIGIBLE FOR MORTGAGE'
000222210623
000223210623     A                                  5 10'Required mortgage amount'
000224210623
000225210623     A            MAMOUNT        9  0B  5 39EDTCDE(2 $)
000226210623
000227210623     A  99                                  DSPATR(PR)
000228210623
000229210623     A  78                                  DSPATR(RI PC)
000230210623
000231210623     A  78                              5 52'MUST NOT BE 0'
000232210623
000233210623     A                                  6 10'Mortage amortization period'
000234210623
000235210623     A            PERIOD         2  0B  6 39EDTCDE(2)
000236210623
000237210623     A  99                                  DSPATR(PR)
000238210623
000239210623     A  79                                  DSPATR(RI PC)
000240210623
000241210623     A                                  6 43'(In Years)'
000242210623
000243210623     A  79                              6 54'MUST NOT BE 0'
000244210623
000245210623     A                                  7 10'Rate type (Fixed/Variable)'
000246210623
000247210623     A            RATETYPE       1   B  7 39VALUES('F' 'V')
000248210623
000249210623     A  99                                  DSPATR(PR)
000250210623
000251210623     A  80                                  DSPATR(RI PC)
000252210623
000253210623     A                                  7 43'(F/V)'
000254210623
000255210623     A  80                              7 49'MUST NOT BE BLANK'
000256210623
000257210623     A          R SHOWRESULT                CF03(03)
000258210623
000259210623     A                                      OVERLAY
000260210623
000261210623     A                                 10 10'Rate available:'
000262210623
000263210623     A            RATE           3  2O 10 39EDTCDE(2)
000264210623
000265210623     A                                 11 10'Maturity date:'
000266210623
000267210623     A            MDATE           L    11 39
000268210623
000269210623     A                                 13 10'Total inquiries:'
000270210623
000271210623     A            COUNTER        2Y 0  13 38EDTCDE(1)
000272210623
000273210623     A                                 16  9'F3 - Exit'
000274210623
000275210623     A            SCOREDSC      10   O  9 39DSPATR(RI)
000276210623
000277210623     A                                  9 10'Score rating description:'
000278210623     A                                  2 21'MORTGAGE RATES CALCULATOR'
000279210623
000280210623     A                                  4 10'Applicant credit score'
000281210623
000282210623     A            CREDSCORE      3  0B  4 39EDTCDE(2)
000283210623
000284210623     A  77                                  DSPATR(RI PC)
000285210623
000286210623     A  99                                  DSPATR(PR)
000287210623
000288210623     A  77                              4 44'NOT ELIGIBLE FOR MORTGAGE'
000289210623
000290210623     A                                  5 10'Required mortgage amount'
000291210623
000292210623     A            MAMOUNT        9  0B  5 39EDTCDE(2 $)
000293210623
000294210623     A  99                                  DSPATR(PR)
000295210623
000296210623     A  78                                  DSPATR(RI PC)
000297210623
000298210623     A  78                              5 52'MUST NOT BE 0'
000299210623
000300210623     A                                  6 10'Mortage amortization period'
000301210623
000302210623     A            PERIOD         2  0B  6 39EDTCDE(2)
000303210623
000304210623     A  99                                  DSPATR(PR)
000305210623
000306210623     A  79                                  DSPATR(RI PC)
000307210623
000308210623     A                                  6 43'(In Years)'
000309210623
000310210623     A  79                              6 54'MUST NOT BE 0'
000311210623
000312210623     A                                  7 10'Rate type (Fixed/Variable)'
000313210623
000314210623     A            RATETYPE       1   B  7 39VALUES('F' 'V')
000315210623
000316210623     A  99                                  DSPATR(PR)
000317210623
000318210623     A  80                                  DSPATR(RI PC)
000319210623
000320210623     A                                  7 43'(F/V)'
000321210623
000322210623     A  80                              7 49'MUST NOT BE BLANK'
000323210623
000324210623     A          R SHOWRESULT                CF03(03)
000325210623
000326210623     A                                      OVERLAY
000327210623
000328210623     A                                 10 10'Rate available:'
000329210623
000330210623     A            RATE           3  2O 10 39EDTCDE(2)
000331210623
000332210623     A                                 11 10'Maturity date:'
000333210623
000334210623     A            MDATE           L    11 39
000335210623
000336210623     A                                 13 10'Total inquiries:'
000337210623
000338210623     A            COUNTER        2Y 0  13 38EDTCDE(1)
000339210623
000340210623     A                                 16  9'F3 - Exit'
000341210623
000342210623     A            SCOREDSC      10   O  9 39DSPATR(RI)
000343210623
000344210623     A                                  9 10'Score rating description:'    A
