000100210709     A          R SHIFTWEEK                 PFILE(SENECAPAY/SHIFTWEEK)
000101210709     A          K EMPNUM
000102210709     A          S WORKSHIFT                 COMP(EQ '1')
