000001210605       DCL-F COVIDDSP WORKSTN;
000002210623       //dcl-s due date;
000003210623
000004210606             EXSR CLEAR;       //CLEAR THE INPUT IN ALL FIELDS
000005210606             EXFMT RISKFACTOR; //WRITE SCREEN RECORD, ENABLES R/W
000006210606
000007210606             DOW NOT(*IN03);   //DOW (*IN03 = *OFF);   //DOU *INO3;
000008210606               IF GENDER = '';  //' ' ALSO ACCEPTABLE
000009210606                 *IN95 = *ON;
000010210606                   EXFMT RISKFACTOR;
000011210606                 *IN95 = *OFF;
000012210606                 ITER;   //WORKS LIKE CONTINUE (GOES TO BEGINNING OF ITERATION DOW LOOP)
000013210606               ELSEIF CVDISEASE = '';
000014210606                 *IN96 = *ON;
000015210606                   EXFMT RISKFACTOR;
000016210606                 *IN96 = *OFF;
000017210606                 ITER;
000018210606               //DO REST OF THE DATA FIELDS 97 - 99
000019210606               ELSEIF DIABETES = '';
000020210606                 *IN97 = *ON;
000021210606                   EXFMT RISKFACTOR;
000022210606                 *IN97 = *OFF;
000023210606                 ITER;
000024210606               ELSEIF RSPDISEASE = '';
000025210606                 *IN98 = *ON;
000026210606                   EXFMT RISKFACTOR;
000027210606                 *IN98 = *OFF;
000028210606                 ITER;
000029210606               ELSEIF HBPRESSURE = '';
000030210606                 *IN99 = *ON;
000031210606                   EXFMT RISKFACTOR;
000032210606                 *IN99 = *OFF;
000033210606                 ITER;
000034210606               ELSE;   //DO CALCULATIONS, PROTECT FIELDS, DSP RISKASSMNT (INPUT CORRECTLY FILLED)
000035210606                 EXSR DETERMINERISK;
000036210606                 TOTALQ = TOTALQ + 1;   //TOTALQ += 1;  //ALSO ACCEPTABLE
000037210606                   *IN60 = *ON;        //ON TO PROTECT INPUT FIELDS
000038210606                   WRITE RISKFACTOR;
000039210606                   EXFMT RISKASSMNT;   //USE EXFMT FOR OVERLAY TO ENABLE F3 OR ENTER
000040210606                   *IN60 = *OFF;
000041210606
000042210606               ENDIF;
000043210606
000044210606               IF *IN03 = *OFF;
000045210606                 EXSR CLEAR;
000046210606                 EXFMT RISKFACTOR;
000047210606               ENDIF;
000048210606
000049210606             ENDDO;
000050210606
000051210606
000052210606             *INLR = *ON;  //END PGM STATEMENTS
000053210606             RETURN;
000054210606
000055210606             //SUBROUTINES
000056210606             BEGSR DETERMINERISK;  //STUB CODE FOR LAB3A
000057210606               FRate = .051;
000058210606               COHORT = 'Group 4';
000059210623               AGE = 25;
000060210623            // due  =  %date() + %years(10);
000061210606             ENDSR;
000062210606
000063210606             BEGSR CLEAR;      //CLEARS INPUT FIELDS IN RISKFACTOR RECORD
000064210606               GENDER = '';
000065210606               CLEAR DIABETES; //DIABETES = '';  //EQUIVALENT STATEMENT OPERATION
000066210606               CLEAR CVDISEASE;
000067210606               CLEAR RSPDISEASE;
000068210606               CLEAR HBPRESSURE;
000069210606             ENDSR;
