000001210609       DCL-F COVIDDSPB WORKSTN;
000002210609       DCL-F COVIDINFO WORKSTN;
000003210606
000004210606             EXSR CLEAR;       //CLEAR THE INPUT IN ALL FIELDS
000005210609             BIRTHDATE = %date();
000006210606             EXFMT RISKFACTOR; //WRITE SCREEN RECORD, ENABLES R/W
000007210606
000008210606             DOW NOT(*IN03);   //DOW (*IN03 = *OFF);   //DOU *INO3;
000009210606               IF GENDER = '';  //' ' ALSO ACCEPTABLE
000010210606                 *IN95 = *ON;
000011210606                   EXFMT RISKFACTOR;
000012210606                 *IN95 = *OFF;
000013210606                 ITER;   //WORKS LIKE CONTINUE (GOES TO BEGINNING OF ITERATION DOW LOOP)
000014210606               ELSEIF CVDISEASE = '';
000015210606                 *IN96 = *ON;
000016210606                   EXFMT RISKFACTOR;
000017210606                 *IN96 = *OFF;
000018210606                 ITER;
000019210606               //DO REST OF THE DATA FIELDS 97 - 99
000020210606               ELSEIF DIABETES = '';
000021210606                 *IN97 = *ON;
000022210606                   EXFMT RISKFACTOR;
000023210606                 *IN97 = *OFF;
000024210606                 ITER;
000025210606               ELSEIF RSPDISEASE = '';
000026210606                 *IN98 = *ON;
000027210606                   EXFMT RISKFACTOR;
000028210606                 *IN98 = *OFF;
000029210606                 ITER;
000030210606               ELSEIF HBPRESSURE = '';
000031210606                 *IN99 = *ON;
000032210606                   EXFMT RISKFACTOR;
000033210606                 *IN99 = *OFF;
000034210606                 ITER;
000035210606               ELSE;   //DO CALCULATIONS, PROTECT FIELDS, DSP RISKASSMNT (INPUT CORRECTLY FILLED)
000036210606                 EXSR DETERMINERISK;
000037210606                 TOTALQ = TOTALQ + 1;   //TOTALQ += 1;  //ALSO ACCEPTABLE
000038210606                   *IN60 = *ON;        //ON TO PROTECT INPUT FIELDS
000039210606                   WRITE RISKFACTOR;
000040210606                   EXFMT RISKASSMNT;   //USE EXFMT FOR OVERLAY TO ENABLE F3 OR ENTER
000041210606                   *IN60 = *OFF;
000042210606
000043210609                   IF *IN01;
000045210609                     EXFMT CINFO;
000046210609                   ENDIF;
000047210609
000048210606               ENDIF;
000049210606
000050210606               IF *IN03 = *OFF;
000051210606                 EXSR CLEAR;
000052210609                 BIRTHDATE = %date();
000053210606                 EXFMT RISKFACTOR;
000054210606               ENDIF;
000055210606
000056210606             ENDDO;
000057210606
000058210606
000059210606             *INLR = *ON;  //END PGM STATEMENTS
000060210606             RETURN;
000061210606
000062210606             //SUBROUTINES
000063210606             BEGSR DETERMINERISK;  //STUB CODE FOR LAB3A
000064210609               //AGE = 25;
000065210609               AGE = %DIFF(%Date(): BIRTHDATE: *YEARS);
000066210609
000067210609               //FRate = .051;
000068210609               EXSR DETERMINEFRATE;
000069210609               EXSR DETERMINEOTHERFACTORS;
000070210609
000071210609               //COHORT = 'Group 4';
000072210609               EXSR DETERMINECOHORT;
000073210606             ENDSR;
000074210606
000075210606             BEGSR CLEAR;      //CLEARS INPUT FIELDS IN RISKFACTOR RECORD
000076210606               GENDER = '';
000077210606               CLEAR DIABETES; //DIABETES = '';  //EQUIVALENT STATEMENT OPERATION
000078210606               CLEAR CVDISEASE;
000079210606               CLEAR RSPDISEASE;
000080210606               CLEAR HBPRESSURE;
000081210606             ENDSR;
000082210609
000083210609             BEGSR DETERMINEFRATE;
000084210609               SELECT;
000085210609                 WHEN AGE >= 80;
000086210609                   FRate = 14.800;
000087210609                 WHEN AGE >= 70;
000088210609                   FRate = 08.000;
000089210609                 WHEN AGE >= 60;
000090210609                   FRate = 03.600;
000091210609                 WHEN AGE >= 50;
000092210609                   FRate = 01.300;
000093210609                 WHEN AGE >= 40;
000094210609                   FRate = 00.400;
000095210609                 WHEN AGE >= 30;
000096210609                   FRate = 00.250;
000097210609                 WHEN AGE >= 20;
000098210609                   FRate = 00.230;
000099210609                 WHEN AGE >= 10;
000100210609                   FRate = 00.200;
000101210609                 WHEN AGE >= 0;
000102210609                   FRate = 00.100;
000103210609               ENDSL;
000104210609             ENDSR;
000105210609
000106210609             BEGSR DETERMINEOTHERFACTORS;
000107210609               IF CVDISEASE = 'Y';
000108210609                 FRate += 00.800;
000109210609               ENDIF;
000110210609               IF DIABETES = 'Y';
000111210609                 FRate += 00.600;
000112210609               ENDIF;
000113210609               IF HBPRESSURE = 'Y';
000114210609                 FRate += 00.300;
000115210609               ENDIF;
000116210609               IF RSPDISEASE = 'Y';
000117210609                 FRate += 00.400;
000118210609               ENDIF;
000119210609               IF GENDER = 'F';
000120210609                 FRate -= 00.050;
000121210609               ENDIF;
000122210609             ENDSR;
000123210609
000124210617             BEGSR DETERMINECOHORT;
000125210609               SELECT;
000126210609                 WHEN FRate >= 9.5;
000127210609                   COHORT = 'Group 1';
000128210609                 WHEN FRate >= 5.5;
000129210609                   COHORT = 'Group 2';
000130210609                 WHEN FRate >= 3.5;
000131210609                   COHORT = 'Group 3';
000132210609                 WHEN FRate >= 1.5;
000133210609                   COHORT = 'Group 4';
000134210609                 WHEN FRate >= 0.0;
000135210609                   COHORT = 'Group 5';
000136210609               ENDSL;
000137210609             ENDSR;
