000100210623       DCL-F MORTG WORKSTN;
000101210623
000102210623       EXSR CLEAR;
000103210623       EXFMT GETDATA;
000104210623
000105210623       DOW NOT(*IN03);
000106210623         RATE = 2.45;
000107210623         IF CREDSCORE < 630;
000108210623           *IN77 = *ON;
000109210623           EXFMT GETDATA;
000110210623           *IN77 = *OFF;
000111210623           ITER;
000112210623         ELSEIF MAMOUNT = '';
000113210623           *IN78 = *ON;
000114210623           EXFMT GETDATA;
000115210623           *IN78 = *OFF;
000116210623           ITER;
000117210623         ELSEIF PERIOD < 0;   //''
000118210623           *IN79 = *ON;
000119210623           EXFMT GETDATA;
000120210623           *IN79 = *OFF;
000121210623           ITER;
000122210623         ELSEIF RATETYPE < 0;  //''
000123210623           *IN80 = *ON;
000124210623           EXFMT GETDATA;
000125210623           *IN80 = *OFF;
000126210623           ITER;
000127210623         ELSE;
000128210623           EXSR RESULTS;
000129210623           COUNTER = COUNTER + 1;
000130210623           *IN99 = *ON;
000131210623           WRITE GETDATA;
000132210623           EXFMT SHOWRESULT;
000133210623           *IN99 = *OFF;
000134210623         ENDIF;
000135210623
000136210623         IF *IN03 = *OFF;
000137210623           EXSR CLEAR;
000138210623           EXFMT GETDATA;
000139210623         ENDIF;
000140210623       ENDDO;
000141210623
000142210623       *INLR = *ON;  //END PGM STATEMENTS
000143210623       RETURN;
000144210623
000145210623       // SUBROUTINES
000146210623       BEGSR RESULTS;
000147210623         EXSR SCOREDESC;
000148210623         EXSR FINDRATE;
000149210623         EXSR FINDMDATE;
000150210623
000151210623       ENDSR;
000152210623
000153210623       BEGSR SCOREDESC;
000154210623         SELECT;
000155210623           WHEN SCORE >= 720;
000156210623             SCOREDSC = 'EXCELLENT';
000157210623           WHEN SCORE >= 690;
000158210623             SCOREDSC = 'GOOD';
000159210623           WHEN SCORE >= 630;
000160210623             SCOREDSC = 'FAIR';
000161210623           OTHER;
000162210623             SCOREDSC = 'BAD';
000163210623         ENDSL;
000164210623       ENDSR;
000165210623
000166210623       BEGSR FINDRATE;
000167210623         IF RATETYPE = 'F';
000168210623           IF SCOREDSC = 'FAIR';
000169210623             RATE -= 0.3;
000170210623           ELSEIF SCOREDSC = 'GOOD';
000171210623             RATE -= 0.5;
000172210623           ELSEIF SCOREDSC = 'EXCELLENT';
000173210623             RATE -= 0.7;
000174210623           ENDIF;
000175210623         ELSE; //RATETYPE IS 'V' VARIABLE
000176210623           IF SCOREDSC = 'FAIR';
000177210623             RATE -= 0.5;
000178210623           ELSEIF SCOREDSC = 'GOOD';
000179210623             RATE -= 0.8;
000180210623           ELSEIF SCOREDSC = 'EXCELLENT';
000181210623             RATE -= 1.1;
000182210623           ENDIF;
000183210623         ENDIF;
000184210623
000185210623         SELECT;
000186210623           WHEN MAMOUNT > 700000;
000187210623             RATE -= 0.1;
000188210623           WHEN MAMOUNT > 500000;
000189210623             RATE -= 0.05;
000190210623         ENDSL;
000191210623       ENDSR;
000192210623
000193210623       BEGSR CLEAR;
000194210623         CREDSCORE = 0;
000195210623         MAMOUNT = 0;
000196210623         PERIOD = 0;
000197210623         CLEAR RATETYPE;
000198210623       ENDSR;
000199210623
000200210623       BEGSR FINDMDATE;
000201210623         //ADD %DATE() AND PERIOD IN YEARS;
000204210623         MDATE = %DATE() + %YEARS(PERIOD);
000205210623       ENDSR;
